Deep-Learning/MiMo-V2.5-Pro-on-MI300X-Benchmark/data/raw-logs/20260713-amd-tuned-moe-expanded-concurrency/points/prefill/benchmark_8192_out1_con2.log
/opt/venv/lib/python3.10/site-packages/transformers/modeling_rope_utils.py:1034: FutureWarning: `rope_config_validation` is deprecated and has been removed. Its functionality has been moved to RotaryEmbeddingConfigMixin.validate_rope method. PreTrainedConfig inherits this class, so please call self.validate_rope() instead. Also, make sure to use the new rope_parameters syntax. You can call self.standardize_rope_params() in the meantime.
  warnings.warn(
benchmark_args=Namespace(backend='sglang', base_url=None, host='<ip>', port=40000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='/data/mimo-public/ShareGPT_V3_unfiltered_cleaned_split.json', speed_bench_category=None, speed_bench_output_len=512, model='/data/models/MiMo-V2.5-Pro', served_model_name=None, tokenizer=None, num_prompts=16, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=1, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=2, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=12345, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=True, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://<ip>:40000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='<ip>', port=40000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='/data/mimo-public/ShareGPT_V3_unfiltered_cleaned_split.json', speed_bench_category=None, speed_bench_output_len=512, model='/data/models/MiMo-V2.5-Pro', served_model_name=None, tokenizer=None, num_prompts=16, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=1, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=2, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=12345, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=True, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 131072
#Output tokens: 16
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

  0%|          | 0/16 [00:00<?, ?it/s]
  6%|▋         | 1/16 [00:00<00:12,  1.20it/s]
 12%|█▎        | 2/16 [00:01<00:08,  1.72it/s]
 19%|█▉        | 3/16 [00:01<00:06,  2.01it/s]
 25%|██▌       | 4/16 [00:02<00:05,  2.14it/s]
 31%|███▏      | 5/16 [00:02<00:04,  2.25it/s]
 38%|███▊      | 6/16 [00:02<00:04,  2.30it/s]
 44%|████▍     | 7/16 [00:03<00:03,  2.36it/s]
 50%|█████     | 8/16 [00:03<00:03,  2.37it/s]
 56%|█████▋    | 9/16 [00:04<00:02,  2.38it/s]
 62%|██████▎   | 10/16 [00:04<00:02,  2.39it/s]
 69%|██████▉   | 11/16 [00:04<00:02,  2.38it/s]
 75%|███████▌  | 12/16 [00:05<00:01,  2.40it/s]
 81%|████████▏ | 13/16 [00:05<00:01,  2.39it/s]
 88%|████████▊ | 14/16 [00:06<00:00,  2.40it/s]
 94%|█████████▍| 15/16 [00:06<00:00,  2.41it/s]
100%|██████████| 16/16 [00:06<00:00,  2.40it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 2         
Successful requests:                     16        
Benchmark duration (s):                  6.68      
Total input tokens:                      131072    
Total input text tokens:                 131072    
Total generated tokens:                  16        
Total generated tokens (retokenized):    16        
Request throughput (req/s):              2.39      
Input token throughput (tok/s):          19618.25  
Output token throughput (tok/s):         2.39      
Peak output token throughput (tok/s):    3.00      
Peak concurrent requests:                5         
Total token throughput (tok/s):          19620.65  
Concurrency:                             1.99      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   829.46    
Median E2E Latency (ms):                 828.12    
P90 E2E Latency (ms):                    835.95    
P95 E2E Latency (ms):                    935.87    
P99 E2E Latency (ms):                    1174.96   
---------------Time to First Token----------------
Mean TTFT (ms):                          829.40    
Median TTFT (ms):                        828.11    
P90 TTFT (ms):                           835.93    
P95 TTFT (ms):                           935.82    
P99 TTFT (ms):                           1174.80   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          0.00      
Median TPOT (ms):                        0.00      
P90 TPOT (ms):                           0.00      
P95 TPOT (ms):                           0.00      
P99 TPOT (ms):                           0.00      
---------------Inter-Token Latency----------------
Mean ITL (ms):                           0.00      
Median ITL (ms):                         0.00      
P90 ITL (ms):                            0.00      
P95 ITL (ms):                            0.00      
P99 ITL (ms):                            0.00      
Max ITL (ms):                            0.00      
==================================================